zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/iisc.h
/* -------- IISC_MR : (IISC Offset: 0x04) (R/W 32) Mode Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t MODE:1;           /*!< bit:      0  Master/Slave/Controller Mode       */
    uint32_t :1;               /*!< bit:      1  Reserved                           */
    uint32_t DATALENGTH:3;     /*!< bit:  2.. 4  Data Word Length                   */
    uint32_t :3;               /*!< bit:  5.. 7  Reserved                           */
    uint32_t RXMONO:1;         /*!< bit:      8  Receiver Mono                      */
    uint32_t RXDMA:1;          /*!< bit:      9  Single or Multiple DMA Channels for Receiver */
    uint32_t RXLOOP:1;         /*!< bit:     10  Loop-back Test Mode                */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t TXMONO:1;         /*!< bit:     12  Transmitter Mono                   */
    uint32_t TXDMA:1;          /*!< bit:     13  Single or Multiple DMA Channels for Transmitter */
    uint32_t TXSAME:1;         /*!< bit:     14  Transmit Data when Underrun        */
    uint32_t :9;               /*!< bit: 15..23  Reserved                           */
    uint32_t IMCKFS:6;         /*!< bit: 24..29  Master Clock to fs Ratio           */
    uint32_t IMCKMODE:1;       /*!< bit:     30  Master Clock Mode                  */
    uint32_t IWS24:1;          /*!< bit:     31  IWS Data Slot Width                */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} IISC_MR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define IISC_MR_OFFSET              0x04         /**< \brief (IISC_MR offset) Mode Register */
#define IISC_MR_RESETVALUE          _U_(0x00000000); /**< \brief (IISC_MR reset_value) Mode Register */

#define IISC_MR_MODE_Pos            0            /**< \brief (IISC_MR) Master/Slave/Controller Mode */
#define IISC_MR_MODE                (_U_(0x1) << IISC_MR_MODE_Pos)
#define   IISC_MR_MODE_SLAVE_Val          _U_(0x0)   /**< \brief (IISC_MR) Slave mode (only serial data handled, clocks received from external master or controller) */
#define   IISC_MR_MODE_MASTER_Val         _U_(0x1)   /**< \brief (IISC_MR) Master mode (clocks generated and output by IISC, serial data handled if CR.RXEN and/or CR.TXEN written to 1) */
#define IISC_MR_MODE_SLAVE          (IISC_MR_MODE_SLAVE_Val        << IISC_MR_MODE_Pos)
#define IISC_MR_MODE_MASTER         (IISC_MR_MODE_MASTER_Val       << IISC_MR_MODE_Pos)
#define IISC_MR_DATALENGTH_Pos      2            /**< \brief (IISC_MR) Data Word Length */
#define IISC_MR_DATALENGTH_Msk      (_U_(0x7) << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH(value)   (IISC_MR_DATALENGTH_Msk & ((value) << IISC_MR_DATALENGTH_Pos))
#define   IISC_MR_DATALENGTH_32_Val       _U_(0x0)   /**< \brief (IISC_MR) 32 bits */
#define   IISC_MR_DATALENGTH_24_Val       _U_(0x1)   /**< \brief (IISC_MR) 24 bits */
#define   IISC_MR_DATALENGTH_20_Val       _U_(0x2)   /**< \brief (IISC_MR) 20 bits */
#define   IISC_MR_DATALENGTH_18_Val       _U_(0x3)   /**< \brief (IISC_MR) 18 bits */
#define   IISC_MR_DATALENGTH_16_Val       _U_(0x4)   /**< \brief (IISC_MR) 16 bits */
#define   IISC_MR_DATALENGTH_16C_Val      _U_(0x5)   /**< \brief (IISC_MR) 16 bits compact stereo */
#define   IISC_MR_DATALENGTH_8_Val        _U_(0x6)   /**< \brief (IISC_MR) 8 bits */
#define   IISC_MR_DATALENGTH_8C_Val       _U_(0x7)   /**< \brief (IISC_MR) 8 bits compact stereo */
#define IISC_MR_DATALENGTH_32       (IISC_MR_DATALENGTH_32_Val     << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH_24       (IISC_MR_DATALENGTH_24_Val     << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH_20       (IISC_MR_DATALENGTH_20_Val     << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH_18       (IISC_MR_DATALENGTH_18_Val     << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH_16       (IISC_MR_DATALENGTH_16_Val     << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH_16C      (IISC_MR_DATALENGTH_16C_Val    << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH_8        (IISC_MR_DATALENGTH_8_Val      << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_DATALENGTH_8C       (IISC_MR_DATALENGTH_8C_Val     << IISC_MR_DATALENGTH_Pos)
#define IISC_MR_RXMONO_Pos          8            /**< \brief (IISC_MR) Receiver Mono */
#define IISC_MR_RXMONO              (_U_(0x1) << IISC_MR_RXMONO_Pos)
#define   IISC_MR_RXMONO_STEREO_Val       _U_(0x0)   /**< \brief (IISC_MR) Normal mode */
#define   IISC_MR_RXMONO_MONO_Val         _U_(0x1)   /**< \brief (IISC_MR) Left channel data is duplicated to right channel */
#define IISC_MR_RXMONO_STEREO       (IISC_MR_RXMONO_STEREO_Val     << IISC_MR_RXMONO_Pos)
#define IISC_MR_RXMONO_MONO         (IISC_MR_RXMONO_MONO_Val       << IISC_MR_RXMONO_Pos)
#define IISC_MR_RXDMA_Pos           9            /**< \brief (IISC_MR) Single or Multiple DMA Channels for Receiver */
#define IISC_MR_RXDMA               (_U_(0x1) << IISC_MR_RXDMA_Pos)
#define   IISC_MR_RXDMA_SINGLE_Val        _U_(0x0)   /**< \brief (IISC_MR) Single DMA channel */
#define   IISC_MR_RXDMA_MULTIPLE_Val      _U_(0x1)   /**< \brief (IISC_MR) One DMA channel per data channel */
#define IISC_MR_RXDMA_SINGLE        (IISC_MR_RXDMA_SINGLE_Val      << IISC_MR_RXDMA_Pos)
#define IISC_MR_RXDMA_MULTIPLE      (IISC_MR_RXDMA_MULTIPLE_Val    << IISC_MR_RXDMA_Pos)
#define IISC_MR_RXLOOP_Pos          10           /**< \brief (IISC_MR) Loop-back Test Mode */
#define IISC_MR_RXLOOP              (_U_(0x1) << IISC_MR_RXLOOP_Pos)
#define   IISC_MR_RXLOOP_OFF_Val          _U_(0x0)   /**< \brief (IISC_MR) Normal mode */
#define   IISC_MR_RXLOOP_ON_Val           _U_(0x1)   /**< \brief (IISC_MR) ISDO internally connected to ISDI */
#define IISC_MR_RXLOOP_OFF          (IISC_MR_RXLOOP_OFF_Val        << IISC_MR_RXLOOP_Pos)
#define IISC_MR_RXLOOP_ON           (IISC_MR_RXLOOP_ON_Val         << IISC_MR_RXLOOP_Pos)
#define IISC_MR_TXMONO_Pos          12           /**< \brief (IISC_MR) Transmitter Mono */
#define IISC_MR_TXMONO              (_U_(0x1) << IISC_MR_TXMONO_Pos)
#define   IISC_MR_TXMONO_STEREO_Val       _U_(0x0)   /**< \brief (IISC_MR) Normal mode */
#define   IISC_MR_TXMONO_MONO_Val         _U_(0x1)   /**< \brief (IISC_MR) Left channel data is duplicated to right channel */
#define IISC_MR_TXMONO_STEREO       (IISC_MR_TXMONO_STEREO_Val     << IISC_MR_TXMONO_Pos)
#define IISC_MR_TXMONO_MONO         (IISC_MR_TXMONO_MONO_Val       << IISC_MR_TXMONO_Pos)
#define IISC_MR_TXDMA_Pos           13           /**< \brief (IISC_MR) Single or Multiple DMA Channels for Transmitter */
#define IISC_MR_TXDMA               (_U_(0x1) << IISC_MR_TXDMA_Pos)
#define   IISC_MR_TXDMA_SINGLE_Val        _U_(0x0)   /**< \brief (IISC_MR) Single DMA channel */
#define   IISC_MR_TXDMA_MULTIPLE_Val      _U_(0x1)   /**< \brief (IISC_MR) One DMA channel per data channel */
#define IISC_MR_TXDMA_SINGLE        (IISC_MR_TXDMA_SINGLE_Val      << IISC_MR_TXDMA_Pos)
#define IISC_MR_TXDMA_MULTIPLE      (IISC_MR_TXDMA_MULTIPLE_Val    << IISC_MR_TXDMA_Pos)
#define IISC_MR_TXSAME_Pos          14           /**< \brief (IISC_MR) Transmit Data when Underrun */
#define IISC_MR_TXSAME              (_U_(0x1) << IISC_MR_TXSAME_Pos)
#define   IISC_MR_TXSAME_ZERO_Val         _U_(0x0)   /**< \brief (IISC_MR) Zero data transmitted in case of underrun */
#define   IISC_MR_TXSAME_SAME_Val         _U_(0x1)   /**< \brief (IISC_MR) Last data transmitted in case of underrun */
#define IISC_MR_TXSAME_ZERO         (IISC_MR_TXSAME_ZERO_Val       << IISC_MR_TXSAME_Pos)
#define IISC_MR_TXSAME_SAME         (IISC_MR_TXSAME_SAME_Val       << IISC_MR_TXSAME_Pos)
#define IISC_MR_IMCKFS_Pos          24           /**< \brief (IISC_MR) Master Clock to fs Ratio */
#define IISC_MR_IMCKFS_Msk          (_U_(0x3F) << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS(value)       (IISC_MR_IMCKFS_Msk & ((value) << IISC_MR_IMCKFS_Pos))
#define   IISC_MR_IMCKFS_16_Val           _U_(0x0)   /**< \brief (IISC_MR) 16 fs */
#define   IISC_MR_IMCKFS_32_Val           _U_(0x1)   /**< \brief (IISC_MR) 32 fs */
#define   IISC_MR_IMCKFS_64_Val           _U_(0x3)   /**< \brief (IISC_MR) 64 fs */
#define   IISC_MR_IMCKFS_128_Val          _U_(0x7)   /**< \brief (IISC_MR) 128 fs */
#define   IISC_MR_IMCKFS_256_Val          _U_(0xF)   /**< \brief (IISC_MR) 256 fs */
#define   IISC_MR_IMCKFS_384_Val          _U_(0x17)   /**< \brief (IISC_MR) 384 fs */
#define   IISC_MR_IMCKFS_512_Val          _U_(0x1F)   /**< \brief (IISC_MR) 512 fs */
#define   IISC_MR_IMCKFS_768_Val          _U_(0x2F)   /**< \brief (IISC_MR) 768 fs */
#define   IISC_MR_IMCKFS_1024_Val         _U_(0x3F)   /**< \brief (IISC_MR) 1024 fs */
#define IISC_MR_IMCKFS_16           (IISC_MR_IMCKFS_16_Val         << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_32           (IISC_MR_IMCKFS_32_Val         << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_64           (IISC_MR_IMCKFS_64_Val         << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_128          (IISC_MR_IMCKFS_128_Val        << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_256          (IISC_MR_IMCKFS_256_Val        << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_384          (IISC_MR_IMCKFS_384_Val        << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_512          (IISC_MR_IMCKFS_512_Val        << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_768          (IISC_MR_IMCKFS_768_Val        << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKFS_1024         (IISC_MR_IMCKFS_1024_Val       << IISC_MR_IMCKFS_Pos)
#define IISC_MR_IMCKMODE_Pos        30           /**< \brief (IISC_MR) Master Clock Mode */
#define IISC_MR_IMCKMODE            (_U_(0x1) << IISC_MR_IMCKMODE_Pos)
#define   IISC_MR_IMCKMODE_NO_IMCK_Val    _U_(0x0)   /**< \brief (IISC_MR) No IMCK generated */
#define   IISC_MR_IMCKMODE_IMCK_Val       _U_(0x1)   /**< \brief (IISC_MR) IMCK generated */
#define IISC_MR_IMCKMODE_NO_IMCK    (IISC_MR_IMCKMODE_NO_IMCK_Val  << IISC_MR_IMCKMODE_Pos)
#define IISC_MR_IMCKMODE_IMCK       (IISC_MR_IMCKMODE_IMCK_Val     << IISC_MR_IMCKMODE_Pos)
#define IISC_MR_IWS24_Pos           31           /**< \brief (IISC_MR) IWS Data Slot Width */
#define IISC_MR_IWS24               (_U_(0x1) << IISC_MR_IWS24_Pos)
#define   IISC_MR_IWS24_32_Val            _U_(0x0)   /**< \brief (IISC_MR) IWS Data Slot is 32-bit wide for DATALENGTH=18/20/24-bit */
#define   IISC_MR_IWS24_24_Val            _U_(0x1)   /**< \brief (IISC_MR) IWS Data Slot is 24-bit wide for DATALENGTH=18/20/24-bit */
#define IISC_MR_IWS24_32            (IISC_MR_IWS24_32_Val          << IISC_MR_IWS24_Pos)
#define IISC_MR_IWS24_24            (IISC_MR_IWS24_24_Val          << IISC_MR_IWS24_Pos)
#define IISC_MR_MASK                _U_(0xFF00771D) /**< \brief (IISC_MR) MASK Register */

/* -------- IISC_SR : (IISC Offset: 0x08) (R/  32) Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXEN:1;           /*!< bit:      0  Receive Enable                     */
    uint32_t RXRDY:1;          /*!< bit:      1  Receive Ready                      */
    uint32_t RXOR:1;           /*!< bit:      2  Receive Overrun                    */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t TXEN:1;           /*!< bit:      4  Transmit Enable                    */
    uint32_t TXRDY:1;          /*!< bit:      5  Transmit Ready                     */
    uint32_t TXUR:1;           /*!< bit:      6  Transmit Underrun                  */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t RXORCH:2;         /*!< bit:  8.. 9  Receive Overrun Channels           */
    uint32_t :10;              /*!< bit: 10..19  Reserved                           */
    uint32_t TXURCH:2;         /*!< bit: 20..21  Transmit Underrun Channels         */
    uint32_t :10;              /*!< bit: 22..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} IISC_SR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define IISC_SR_OFFSET              0x08         /**< \brief (IISC_SR offset) Status Register */
#define IISC_SR_RESETVALUE          _U_(0x00000000); /**< \brief (IISC_SR reset_value) Status Register */

