zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/iisc.h
#define IISC_SCR_OFFSET             0x0C         /**< \brief (IISC_SCR offset) Status Clear Register */

#define IISC_SCR_RXOR_Pos           2            /**< \brief (IISC_SCR) Receive Overrun */
#define IISC_SCR_RXOR               (_U_(0x1) << IISC_SCR_RXOR_Pos)
#define   IISC_SCR_RXOR_NO_Val            _U_(0x0)   /**< \brief (IISC_SCR) No effect */
#define   IISC_SCR_RXOR_CLEAR_Val         _U_(0x1)   /**< \brief (IISC_SCR) Clears the corresponding SR bit */
#define IISC_SCR_RXOR_NO            (IISC_SCR_RXOR_NO_Val          << IISC_SCR_RXOR_Pos)
#define IISC_SCR_RXOR_CLEAR         (IISC_SCR_RXOR_CLEAR_Val       << IISC_SCR_RXOR_Pos)
#define IISC_SCR_TXUR_Pos           6            /**< \brief (IISC_SCR) Transmit Underrun */
#define IISC_SCR_TXUR               (_U_(0x1) << IISC_SCR_TXUR_Pos)
#define   IISC_SCR_TXUR_NO_Val            _U_(0x0)   /**< \brief (IISC_SCR) No effect */
#define   IISC_SCR_TXUR_CLEAR_Val         _U_(0x1)   /**< \brief (IISC_SCR) Clears the corresponding SR bit */
#define IISC_SCR_TXUR_NO            (IISC_SCR_TXUR_NO_Val          << IISC_SCR_TXUR_Pos)
#define IISC_SCR_TXUR_CLEAR         (IISC_SCR_TXUR_CLEAR_Val       << IISC_SCR_TXUR_Pos)
#define IISC_SCR_RXORCH_Pos         8            /**< \brief (IISC_SCR) Receive Overrun Channels */
#define IISC_SCR_RXORCH_Msk         (_U_(0x3) << IISC_SCR_RXORCH_Pos)
#define IISC_SCR_RXORCH(value)      (IISC_SCR_RXORCH_Msk & ((value) << IISC_SCR_RXORCH_Pos))
#define IISC_SCR_TXURCH_Pos         20           /**< \brief (IISC_SCR) Transmit Underrun Channels */
#define IISC_SCR_TXURCH_Msk         (_U_(0x3) << IISC_SCR_TXURCH_Pos)
#define IISC_SCR_TXURCH(value)      (IISC_SCR_TXURCH_Msk & ((value) << IISC_SCR_TXURCH_Pos))
#define IISC_SCR_MASK               _U_(0x00300344) /**< \brief (IISC_SCR) MASK Register */

/* -------- IISC_SSR : (IISC Offset: 0x10) ( /W 32) Status Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t RXOR:1;           /*!< bit:      2  Receive Overrun                    */
    uint32_t :3;               /*!< bit:  3.. 5  Reserved                           */
    uint32_t TXUR:1;           /*!< bit:      6  Transmit Underrun                  */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t RXORCH:2;         /*!< bit:  8.. 9  Receive Overrun Channels           */
    uint32_t :10;              /*!< bit: 10..19  Reserved                           */
    uint32_t TXURCH:2;         /*!< bit: 20..21  Transmit Underrun Channels         */
    uint32_t :10;              /*!< bit: 22..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} IISC_SSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define IISC_SSR_OFFSET             0x10         /**< \brief (IISC_SSR offset) Status Set Register */

#define IISC_SSR_RXOR_Pos           2            /**< \brief (IISC_SSR) Receive Overrun */
#define IISC_SSR_RXOR               (_U_(0x1) << IISC_SSR_RXOR_Pos)
#define   IISC_SSR_RXOR_NO_Val            _U_(0x0)   /**< \brief (IISC_SSR) No effect */
#define   IISC_SSR_RXOR_SET_Val           _U_(0x1)   /**< \brief (IISC_SSR) Sets corresponding SR bit */
#define IISC_SSR_RXOR_NO            (IISC_SSR_RXOR_NO_Val          << IISC_SSR_RXOR_Pos)
#define IISC_SSR_RXOR_SET           (IISC_SSR_RXOR_SET_Val         << IISC_SSR_RXOR_Pos)
#define IISC_SSR_TXUR_Pos           6            /**< \brief (IISC_SSR) Transmit Underrun */
#define IISC_SSR_TXUR               (_U_(0x1) << IISC_SSR_TXUR_Pos)
#define   IISC_SSR_TXUR_NO_Val            _U_(0x0)   /**< \brief (IISC_SSR) No effect */
#define   IISC_SSR_TXUR_SET_Val           _U_(0x1)   /**< \brief (IISC_SSR) Sets corresponding SR bit */
#define IISC_SSR_TXUR_NO            (IISC_SSR_TXUR_NO_Val          << IISC_SSR_TXUR_Pos)
#define IISC_SSR_TXUR_SET           (IISC_SSR_TXUR_SET_Val         << IISC_SSR_TXUR_Pos)
#define IISC_SSR_RXORCH_Pos         8            /**< \brief (IISC_SSR) Receive Overrun Channels */
#define IISC_SSR_RXORCH_Msk         (_U_(0x3) << IISC_SSR_RXORCH_Pos)
#define IISC_SSR_RXORCH(value)      (IISC_SSR_RXORCH_Msk & ((value) << IISC_SSR_RXORCH_Pos))
#define IISC_SSR_TXURCH_Pos         20           /**< \brief (IISC_SSR) Transmit Underrun Channels */
#define IISC_SSR_TXURCH_Msk         (_U_(0x3) << IISC_SSR_TXURCH_Pos)
#define IISC_SSR_TXURCH(value)      (IISC_SSR_TXURCH_Msk & ((value) << IISC_SSR_TXURCH_Pos))
#define IISC_SSR_MASK               _U_(0x00300344) /**< \brief (IISC_SSR) MASK Register */

/* -------- IISC_IER : (IISC Offset: 0x14) ( /W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :1;               /*!< bit:      0  Reserved                           */
    uint32_t RXRDY:1;          /*!< bit:      1  Receiver Ready Interrupt Enable    */
    uint32_t RXOR:1;           /*!< bit:      2  Receive Overrun Interrupt Enable   */
    uint32_t :2;               /*!< bit:  3.. 4  Reserved                           */
    uint32_t TXRDY:1;          /*!< bit:      5  Transmit Ready Interrupt Enable    */
    uint32_t TXUR:1;           /*!< bit:      6  Transmit Underrun Interrupt Enable */
    uint32_t :25;              /*!< bit:  7..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} IISC_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define IISC_IER_OFFSET             0x14         /**< \brief (IISC_IER offset) Interrupt Enable Register */

#define IISC_IER_RXRDY_Pos          1            /**< \brief (IISC_IER) Receiver Ready Interrupt Enable */
#define IISC_IER_RXRDY              (_U_(0x1) << IISC_IER_RXRDY_Pos)
#define   IISC_IER_RXRDY_OFF_Val          _U_(0x0)   /**< \brief (IISC_IER) No effect */
#define   IISC_IER_RXRDY_ON_Val           _U_(0x1)   /**< \brief (IISC_IER) Enables the corresponding interrupt */
#define IISC_IER_RXRDY_OFF          (IISC_IER_RXRDY_OFF_Val        << IISC_IER_RXRDY_Pos)
#define IISC_IER_RXRDY_ON           (IISC_IER_RXRDY_ON_Val         << IISC_IER_RXRDY_Pos)
#define IISC_IER_RXOR_Pos           2            /**< \brief (IISC_IER) Receive Overrun Interrupt Enable */
#define IISC_IER_RXOR               (_U_(0x1) << IISC_IER_RXOR_Pos)
#define   IISC_IER_RXOR_OFF_Val           _U_(0x0)   /**< \brief (IISC_IER) No effect */
#define   IISC_IER_RXOR_ON_Val            _U_(0x1)   /**< \brief (IISC_IER) Enables the corresponding interrupt */
#define IISC_IER_RXOR_OFF           (IISC_IER_RXOR_OFF_Val         << IISC_IER_RXOR_Pos)
#define IISC_IER_RXOR_ON            (IISC_IER_RXOR_ON_Val          << IISC_IER_RXOR_Pos)
#define IISC_IER_TXRDY_Pos          5            /**< \brief (IISC_IER) Transmit Ready Interrupt Enable */
#define IISC_IER_TXRDY              (_U_(0x1) << IISC_IER_TXRDY_Pos)
#define   IISC_IER_TXRDY_OFF_Val          _U_(0x0)   /**< \brief (IISC_IER) No effect */
#define   IISC_IER_TXRDY_ON_Val           _U_(0x1)   /**< \brief (IISC_IER) Enables the corresponding interrupt */
#define IISC_IER_TXRDY_OFF          (IISC_IER_TXRDY_OFF_Val        << IISC_IER_TXRDY_Pos)
#define IISC_IER_TXRDY_ON           (IISC_IER_TXRDY_ON_Val         << IISC_IER_TXRDY_Pos)
#define IISC_IER_TXUR_Pos           6            /**< \brief (IISC_IER) Transmit Underrun Interrupt Enable */
#define IISC_IER_TXUR               (_U_(0x1) << IISC_IER_TXUR_Pos)
#define   IISC_IER_TXUR_OFF_Val           _U_(0x0)   /**< \brief (IISC_IER) No effect */
#define   IISC_IER_TXUR_ON_Val            _U_(0x1)   /**< \brief (IISC_IER) Enables the corresponding interrupt */
#define IISC_IER_TXUR_OFF           (IISC_IER_TXUR_OFF_Val         << IISC_IER_TXUR_Pos)
#define IISC_IER_TXUR_ON            (IISC_IER_TXUR_ON_Val          << IISC_IER_TXUR_Pos)
#define IISC_IER_MASK               _U_(0x00000066) /**< \brief (IISC_IER) MASK Register */

/* -------- IISC_IDR : (IISC Offset: 0x18) ( /W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :1;               /*!< bit:      0  Reserved                           */
    uint32_t RXRDY:1;          /*!< bit:      1  Receive Ready Interrupt Disable    */
    uint32_t RXOR:1;           /*!< bit:      2  Receive Overrun Interrupt Disable  */
    uint32_t :2;               /*!< bit:  3.. 4  Reserved                           */
    uint32_t TXRDY:1;          /*!< bit:      5  Transmit Ready Interrupt Disable   */
    uint32_t TXUR:1;           /*!< bit:      6  Transmit Underrun Interrupt Disable */
    uint32_t :25;              /*!< bit:  7..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} IISC_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define IISC_IDR_OFFSET             0x18         /**< \brief (IISC_IDR offset) Interrupt Disable Register */

#define IISC_IDR_RXRDY_Pos          1            /**< \brief (IISC_IDR) Receive Ready Interrupt Disable */
#define IISC_IDR_RXRDY              (_U_(0x1) << IISC_IDR_RXRDY_Pos)
#define   IISC_IDR_RXRDY_OFF_Val          _U_(0x0)   /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_RXRDY_ON_Val           _U_(0x1)   /**< \brief (IISC_IDR) Disables the corresponding interrupt */
#define IISC_IDR_RXRDY_OFF          (IISC_IDR_RXRDY_OFF_Val        << IISC_IDR_RXRDY_Pos)
#define IISC_IDR_RXRDY_ON           (IISC_IDR_RXRDY_ON_Val         << IISC_IDR_RXRDY_Pos)
#define IISC_IDR_RXOR_Pos           2            /**< \brief (IISC_IDR) Receive Overrun Interrupt Disable */
#define IISC_IDR_RXOR               (_U_(0x1) << IISC_IDR_RXOR_Pos)
#define   IISC_IDR_RXOR_OFF_Val           _U_(0x0)   /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_RXOR_ON_Val            _U_(0x1)   /**< \brief (IISC_IDR) Disables the corresponding interrupt */
#define IISC_IDR_RXOR_OFF           (IISC_IDR_RXOR_OFF_Val         << IISC_IDR_RXOR_Pos)
#define IISC_IDR_RXOR_ON            (IISC_IDR_RXOR_ON_Val          << IISC_IDR_RXOR_Pos)
#define IISC_IDR_TXRDY_Pos          5            /**< \brief (IISC_IDR) Transmit Ready Interrupt Disable */
#define IISC_IDR_TXRDY              (_U_(0x1) << IISC_IDR_TXRDY_Pos)
#define   IISC_IDR_TXRDY_OFF_Val          _U_(0x0)   /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_TXRDY_ON_Val           _U_(0x1)   /**< \brief (IISC_IDR) Disables the corresponding interrupt */
#define IISC_IDR_TXRDY_OFF          (IISC_IDR_TXRDY_OFF_Val        << IISC_IDR_TXRDY_Pos)
#define IISC_IDR_TXRDY_ON           (IISC_IDR_TXRDY_ON_Val         << IISC_IDR_TXRDY_Pos)
#define IISC_IDR_TXUR_Pos           6            /**< \brief (IISC_IDR) Transmit Underrun Interrupt Disable */
#define IISC_IDR_TXUR               (_U_(0x1) << IISC_IDR_TXUR_Pos)
#define   IISC_IDR_TXUR_OFF_Val           _U_(0x0)   /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_TXUR_ON_Val            _U_(0x1)   /**< \brief (IISC_IDR) Disables the corresponding interrupt */
#define IISC_IDR_TXUR_OFF           (IISC_IDR_TXUR_OFF_Val         << IISC_IDR_TXUR_Pos)
#define IISC_IDR_TXUR_ON            (IISC_IDR_TXUR_ON_Val          << IISC_IDR_TXUR_Pos)
#define IISC_IDR_MASK               _U_(0x00000066) /**< \brief (IISC_IDR) MASK Register */

/* -------- IISC_IMR : (IISC Offset: 0x1C) (R/  32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :1;               /*!< bit:      0  Reserved                           */
    uint32_t RXRDY:1;          /*!< bit:      1  Receive Ready Interrupt Mask       */
    uint32_t RXOR:1;           /*!< bit:      2  Receive Overrun Interrupt Mask     */
    uint32_t :2;               /*!< bit:  3.. 4  Reserved                           */
    uint32_t TXRDY:1;          /*!< bit:      5  Transmit Ready Interrupt Mask      */
    uint32_t TXUR:1;           /*!< bit:      6  Transmit Underrun Interrupt Mask   */
    uint32_t :25;              /*!< bit:  7..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} IISC_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

