zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/iisc.h
#define IISC_IMR_OFFSET             0x1C         /**< \brief (IISC_IMR offset) Interrupt Mask Register */
#define IISC_IMR_RESETVALUE         _U_(0x00000000); /**< \brief (IISC_IMR reset_value) Interrupt Mask Register */

#define IISC_IMR_RXRDY_Pos          1            /**< \brief (IISC_IMR) Receive Ready Interrupt Mask */
#define IISC_IMR_RXRDY              (_U_(0x1) << IISC_IMR_RXRDY_Pos)
#define   IISC_IMR_RXRDY_DISABLED_Val     _U_(0x0)   /**< \brief (IISC_IMR) The corresponding interrupt is disabled */
#define   IISC_IMR_RXRDY_ENABLED_Val      _U_(0x1)   /**< \brief (IISC_IMR) The corresponding interrupt is enabled */
#define IISC_IMR_RXRDY_DISABLED     (IISC_IMR_RXRDY_DISABLED_Val   << IISC_IMR_RXRDY_Pos)
#define IISC_IMR_RXRDY_ENABLED      (IISC_IMR_RXRDY_ENABLED_Val    << IISC_IMR_RXRDY_Pos)
#define IISC_IMR_RXOR_Pos           2            /**< \brief (IISC_IMR) Receive Overrun Interrupt Mask */
#define IISC_IMR_RXOR               (_U_(0x1) << IISC_IMR_RXOR_Pos)
#define   IISC_IMR_RXOR_DISABLED_Val      _U_(0x0)   /**< \brief (IISC_IMR) The corresponding interrupt is disabled */
#define   IISC_IMR_RXOR_ENABLED_Val       _U_(0x1)   /**< \brief (IISC_IMR) The corresponding interrupt is enabled */
#define IISC_IMR_RXOR_DISABLED      (IISC_IMR_RXOR_DISABLED_Val    << IISC_IMR_RXOR_Pos)
#define IISC_IMR_RXOR_ENABLED       (IISC_IMR_RXOR_ENABLED_Val     << IISC_IMR_RXOR_Pos)
#define IISC_IMR_TXRDY_Pos          5            /**< \brief (IISC_IMR) Transmit Ready Interrupt Mask */
#define IISC_IMR_TXRDY              (_U_(0x1) << IISC_IMR_TXRDY_Pos)
#define   IISC_IMR_TXRDY_DISABLED_Val     _U_(0x0)   /**< \brief (IISC_IMR) The corresponding interrupt is disabled */
#define   IISC_IMR_TXRDY_ENABLED_Val      _U_(0x1)   /**< \brief (IISC_IMR) The corresponding interrupt is enabled */
#define IISC_IMR_TXRDY_DISABLED     (IISC_IMR_TXRDY_DISABLED_Val   << IISC_IMR_TXRDY_Pos)
#define IISC_IMR_TXRDY_ENABLED      (IISC_IMR_TXRDY_ENABLED_Val    << IISC_IMR_TXRDY_Pos)
#define IISC_IMR_TXUR_Pos           6            /**< \brief (IISC_IMR) Transmit Underrun Interrupt Mask */
#define IISC_IMR_TXUR               (_U_(0x1) << IISC_IMR_TXUR_Pos)
#define   IISC_IMR_TXUR_DISABLED_Val      _U_(0x0)   /**< \brief (IISC_IMR) The corresponding interrupt is disabled */
#define   IISC_IMR_TXUR_ENABLED_Val       _U_(0x1)   /**< \brief (IISC_IMR) The corresponding interrupt is enabled */
#define IISC_IMR_TXUR_DISABLED      (IISC_IMR_TXUR_DISABLED_Val    << IISC_IMR_TXUR_Pos)
#define IISC_IMR_TXUR_ENABLED       (IISC_IMR_TXUR_ENABLED_Val     << IISC_IMR_TXUR_Pos)
#define IISC_IMR_MASK               _U_(0x00000066) /**< \brief (IISC_IMR) MASK Register */

/* -------- IISC_RHR : (IISC Offset: 0x20) (R/  32) Receive Holding Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RDAT:32;          /*!< bit:  0..31  Receive Data                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} IISC_RHR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define IISC_RHR_OFFSET             0x20         /**< \brief (IISC_RHR offset) Receive Holding Register */
#define IISC_RHR_RESETVALUE         _U_(0x00000000); /**< \brief (IISC_RHR reset_value) Receive Holding Register */

#define IISC_RHR_RDAT_Pos           0            /**< \brief (IISC_RHR) Receive Data */
#define IISC_RHR_RDAT_Msk           (_U_(0xFFFFFFFF) << IISC_RHR_RDAT_Pos)
#define IISC_RHR_RDAT(value)        (IISC_RHR_RDAT_Msk & ((value) << IISC_RHR_RDAT_Pos))
#define IISC_RHR_MASK               _U_(0xFFFFFFFF) /**< \brief (IISC_RHR) MASK Register */

/* -------- IISC_THR : (IISC Offset: 0x24) ( /W 32) Transmit Holding Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TDAT:32;          /*!< bit:  0..31  Transmit Data                      */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} IISC_THR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define IISC_THR_OFFSET             0x24         /**< \brief (IISC_THR offset) Transmit Holding Register */

#define IISC_THR_TDAT_Pos           0            /**< \brief (IISC_THR) Transmit Data */
#define IISC_THR_TDAT_Msk           (_U_(0xFFFFFFFF) << IISC_THR_TDAT_Pos)
#define IISC_THR_TDAT(value)        (IISC_THR_TDAT_Msk & ((value) << IISC_THR_TDAT_Pos))
#define IISC_THR_MASK               _U_(0xFFFFFFFF) /**< \brief (IISC_THR) MASK Register */

/* -------- IISC_VERSION : (IISC Offset: 0x28) (R/  32) Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Reserved. Value subject to change. No functionality associated. This is the Atmel internal version of the macrocell. */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:4;        /*!< bit: 16..19  Reserved. Value subject to change. No functionality associated. */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} IISC_VERSION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define IISC_VERSION_OFFSET         0x28         /**< \brief (IISC_VERSION offset) Version Register */
#define IISC_VERSION_RESETVALUE     _U_(0x00000100); /**< \brief (IISC_VERSION reset_value) Version Register */

#define IISC_VERSION_VERSION_Pos    0            /**< \brief (IISC_VERSION) Reserved. Value subject to change. No functionality associated. This is the Atmel internal version of the macrocell. */
#define IISC_VERSION_VERSION_Msk    (_U_(0xFFF) << IISC_VERSION_VERSION_Pos)
#define IISC_VERSION_VERSION(value) (IISC_VERSION_VERSION_Msk & ((value) << IISC_VERSION_VERSION_Pos))
#define IISC_VERSION_VARIANT_Pos    16           /**< \brief (IISC_VERSION) Reserved. Value subject to change. No functionality associated. */
#define IISC_VERSION_VARIANT_Msk    (_U_(0xF) << IISC_VERSION_VARIANT_Pos)
#define IISC_VERSION_VARIANT(value) (IISC_VERSION_VARIANT_Msk & ((value) << IISC_VERSION_VARIANT_Pos))
#define IISC_VERSION_MASK           _U_(0x000F0FFF) /**< \brief (IISC_VERSION) MASK Register */

/* -------- IISC_PARAMETER : (IISC Offset: 0x2C) (R/  32) Parameter Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :7;               /*!< bit:  0.. 6  Reserved                           */
    uint32_t FORMAT:1;         /*!< bit:      7  Data protocol format               */
    uint32_t :8;               /*!< bit:  8..15  Reserved                           */
    uint32_t NBCHAN:5;         /*!< bit: 16..20  Maximum number of channels - 1     */
    uint32_t :11;              /*!< bit: 21..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} IISC_PARAMETER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define IISC_PARAMETER_OFFSET       0x2C         /**< \brief (IISC_PARAMETER offset) Parameter Register */
#define IISC_PARAMETER_RESETVALUE   _U_(0x00010000); /**< \brief (IISC_PARAMETER reset_value) Parameter Register */

#define IISC_PARAMETER_FORMAT_Pos   7            /**< \brief (IISC_PARAMETER) Data protocol format */
#define IISC_PARAMETER_FORMAT       (_U_(0x1) << IISC_PARAMETER_FORMAT_Pos)
#define   IISC_PARAMETER_FORMAT_I2S_Val   _U_(0x0)   /**< \brief (IISC_PARAMETER) I2S format, stereo with IWS low for left channel */
#define IISC_PARAMETER_FORMAT_I2S   (IISC_PARAMETER_FORMAT_I2S_Val << IISC_PARAMETER_FORMAT_Pos)
#define IISC_PARAMETER_NBCHAN_Pos   16           /**< \brief (IISC_PARAMETER) Maximum number of channels - 1 */
#define IISC_PARAMETER_NBCHAN_Msk   (_U_(0x1F) << IISC_PARAMETER_NBCHAN_Pos)
#define IISC_PARAMETER_NBCHAN(value) (IISC_PARAMETER_NBCHAN_Msk & ((value) << IISC_PARAMETER_NBCHAN_Pos))
#define IISC_PARAMETER_MASK         _U_(0x001F0080) /**< \brief (IISC_PARAMETER) MASK Register */

/** \brief IISC hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __O  IISC_CR_Type              CR;          /**< \brief Offset: 0x00 ( /W 32) Control Register */
  __IO IISC_MR_Type              MR;          /**< \brief Offset: 0x04 (R/W 32) Mode Register */
  __I  IISC_SR_Type              SR;          /**< \brief Offset: 0x08 (R/  32) Status Register */
  __O  IISC_SCR_Type             SCR;         /**< \brief Offset: 0x0C ( /W 32) Status Clear Register */
  __O  IISC_SSR_Type             SSR;         /**< \brief Offset: 0x10 ( /W 32) Status Set Register */
  __O  IISC_IER_Type             IER;         /**< \brief Offset: 0x14 ( /W 32) Interrupt Enable Register */
  __O  IISC_IDR_Type             IDR;         /**< \brief Offset: 0x18 ( /W 32) Interrupt Disable Register */
  __I  IISC_IMR_Type             IMR;         /**< \brief Offset: 0x1C (R/  32) Interrupt Mask Register */
  __I  IISC_RHR_Type             RHR;         /**< \brief Offset: 0x20 (R/  32) Receive Holding Register */
  __O  IISC_THR_Type             THR;         /**< \brief Offset: 0x24 ( /W 32) Transmit Holding Register */
  __I  IISC_VERSION_Type         VERSION;     /**< \brief Offset: 0x28 (R/  32) Version Register */
  __I  IISC_PARAMETER_Type       PARAMETER;   /**< \brief Offset: 0x2C (R/  32) Parameter Register */
 } bf;
 struct {
  WoReg   IISC_CR;            /**< \brief (IISC Offset: 0x00) Control Register */
  RwReg   IISC_MR;            /**< \brief (IISC Offset: 0x04) Mode Register */
  RoReg   IISC_SR;            /**< \brief (IISC Offset: 0x08) Status Register */
  WoReg   IISC_SCR;           /**< \brief (IISC Offset: 0x0C) Status Clear Register */
  WoReg   IISC_SSR;           /**< \brief (IISC Offset: 0x10) Status Set Register */
  WoReg   IISC_IER;           /**< \brief (IISC Offset: 0x14) Interrupt Enable Register */
  WoReg   IISC_IDR;           /**< \brief (IISC Offset: 0x18) Interrupt Disable Register */
  RoReg   IISC_IMR;           /**< \brief (IISC Offset: 0x1C) Interrupt Mask Register */
  RoReg   IISC_RHR;           /**< \brief (IISC Offset: 0x20) Receive Holding Register */
  WoReg   IISC_THR;           /**< \brief (IISC Offset: 0x24) Transmit Holding Register */
  RoReg   IISC_VERSION;       /**< \brief (IISC Offset: 0x28) Version Register */
  RoReg   IISC_PARAMETER;     /**< \brief (IISC Offset: 0x2C) Parameter Register */
 } reg;
} Iisc;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_IISC_COMPONENT_ */
